results/2/bench-c8-i2048o512.log

Throughput
note: saving the result JSON to /root/inference-poc/results/2/result-c8-i2048o512.json
note: sampling GPU temperature and power every 2s -> /root/inference-poc/results/2/gpu_thermals.csv
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x77869155c5e0>, trust_remote_code=False, seed=0, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='localhost', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='deepseek-ai/DeepSeek-V4-Pro-0813', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['ignore_eos=1', 'random_range_ratio=0.0'], result_dir=None, result_filename='/root/inference-poc/results/2/result-c8-i2048o512.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-7b03b90a-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-17 03:41:20 [config.py:774] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 08-17 03:41:22 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 64/64 [01:19<00:00,  1.25s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  79.97     
Total input tokens:                      131328    
Total generated tokens:                  32768     
Request throughput (req/s):              0.80      
Output token throughput (tok/s):         409.74    
Peak output token throughput (tok/s):    236.00    
Peak concurrent requests:                11.00     
Total token throughput (tok/s):          2051.88   
---------------Time to First Token----------------
Mean TTFT (ms):                          602.23    
Median TTFT (ms):                        314.07    
P99 TTFT (ms):                           2976.33   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.58     
Median TPOT (ms):                        17.58     
P99 TPOT (ms):                           29.97     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.64     
Median ITL (ms):                         34.36     
P99 ITL (ms):                            248.32    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9587.39   
Median E2EL (ms):                        9552.68   
P99 E2EL (ms):                           15626.87  
---------------Speculative Decoding---------------
Acceptance rate (%):                     18.27     
Acceptance length:                       2.28      
Drafts:                                  14401     
Draft tokens:                            100807    
Accepted tokens:                         18421     
Per-position acceptance (%):
  Position 0:                            54.93     
  Position 1:                            30.71     
  Position 2:                            18.14     
  Position 3:                            10.72     
  Position 4:                            6.70      
  Position 5:                            4.35      
  Position 6:                            2.36      
==================================================